//PLICNT   JOB ,MSGLEVEL=(2,0),CLASS=7
//PLI      EXEC PGM=IBMZPLI,
//    PARM='OBJECT,OPTIONS,SOURCE',
//    REGION=0M
//STEPLIB  DD  DSN=IEL610.SIBMZCMP,DISP=SHR
//         DD  DSN=CEE.SCEERUN,DISP=SHR
//SYSIN    DD  DSN=ZXP.PUBLIC.SOURCE(PLICNT),DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),UNIT=SYSALLDA,
//             SPACE=(CYL,(1,1)),DCB=(LRECL=80,BLKSIZE=3200)
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSALLDA,
//             SPACE=(1024,(200,50),,CONTIG,ROUND),DCB=BLKSIZE=1024
//***************************************************/
// IF RC < 8 THEN
//***************************************************/
//BIND     EXEC PGM=IEWBLINK,
//             PARM='XREF,COMPAT=PM3',REGION=2048K
//SYSLIB   DD  DSN=CEE.SCEELKED,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSN=*.PLI.SYSLIN,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=&SYSUID..LOAD(PLICNT),DISP=SHR
//SYSDEFSD DD  DUMMY
//SYSIN    DD  DUMMY
// ELSE
// ENDIF
//***************************************************/
// IF RC < 5 THEN
//***************************************************/
//EXECUTE  EXEC PGM=PLICNT,REGION=32M
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//          DD DSN=CEE.SCEERUN,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
//SYSOUT    DD SYSOUT=*,OUTLIM=10
//PRTDONE   DD SYSOUT=*,OUTLIM=10
//PRTLINE   DD DSN=&SYSUID..PLICNT.PRTLINE,DISP=OLD
//***************************************************/
// ELSE
// ENDIF
