//WSLJCL    JOB ,MSGLEVEL=(0,0),CLASS=7
//COMBINE   EXEC PGM=IRXJCL,PARM='WSL'
//SYSEXEC   DD DSN=ZXP.PUBLIC.EXEC,DISP=SHR
//SYSTSPRT  DD SYSOUT=*
//SYSTSIN   DD DUMMY
//IDIREPRT  DD DUMMY
//TEAM      DD DSN=ZXP.PUBLIC.DATA(TEAM),DISP=SHR
//CITY      DD DSN=ZXP.PUBLIC.DATA(CITY),DISP=SHR
//STATE     DD DSN=ZXP.PUBLIC.DATA(STATE),DISP=SHR
//STADIUM   DD DSN=ZXP.PUBLIC.DATA(STADIUM),DISP=SHR
//CAPACITY  DD DSN=ZXP.PUBLIC.DATA(CAPACITY),DISP=SHR
//COACH     DD DSN=ZXP.PUBLIC.DATA(COACH),DISP=SHR
